# specify a directory to install
cask_args appdir: '~/Applications'

tap 'homebrew/bundle'

# Casks
cask 'google-cloud-sdk'
cask 'awscli'
cask 'oracle-jdk'
cask 'google-chrome'
cask 'firefox'
cask 'tor-browser'
cask 'skype'
cask 'slack'
cask 'telegram'
cask 'zoom'
cask 'tunnelblick'
cask 'sublime-text'
cask 'docker'
cask 'macpass'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vlc'
cask 'transmission'
cask 'spotify'
cask 'multipass'
cask 'the-unarchiver'
cask 'resilio-sync'
