# Homebrew
tap 'homebrew/bundle'

# Fonts
cask "font-fira-code"
cask 'font-zed-mono-nerd-font'
cask 'font-zed-mono'
cask 'font-zed-sans'

# Tfswitch
tap "warrensbox/tap"
brew "warrensbox/tap/tfswitch"

# Hashicorp
tap 'hashicorp/tap'

# Packages
brew 'ansible'
brew 'ansible-lint'
brew 'asciinema'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'cfssl'
brew 'fping'
brew 'gh'
brew 'go'
brew 'grip'
brew 'helm'
brew 'htop'
brew 'istioctl'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lolcat'
brew 'minikube'
brew 'mtr'
brew 'neofetch'
brew 'nmap'
brew 'osx-cpu-temp'
brew 'pipx'
brew 'pre-commit'
brew 'screen'
brew 'shellcheck'
brew 'shfmt'
brew 'skopeo'
brew 'sops'
brew 'sniffnet'
brew 'starship'
brew 'telnet'
brew 'terragrunt'
brew 'tflint'
brew 'tmux'
brew 'vim'
brew 'watch'
brew 'yt-dlp'

# Casks
cask 'amneziavpn'
cask 'appcleaner'
cask 'balenaetcher'
cask 'cyberduck'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'imageoptim'
cask 'macpass'
cask 'motrix'
cask 'obsidian'
cask 'onyx'
cask 'raspberry-pi-imager'
cask 'resilio-sync'
cask 'slack'
cask 'talosctl'
cask 'telegram'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'vmware-fusion'
cask 'vlc'
cask 'qflipper'
cask 'wezterm'
cask 'zed'
cask 'zoom'
