# specify a directory to install
# as a default cask argument
cask_args appdir: '~/Applications'

# Homebrew
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'

# Awesome fonts
tap 'homebrew/cask-fonts'
cask "font-fira-code"

# Tfswitch
tap "warrensbox/tap"
brew "warrensbox/tap/tfswitch"

# Hashicorp products
tap 'hashicorp/tap'
brew 'packer'
brew 'terraform'

# Packages
brew 'ansible'
brew 'ansible-lint'
brew 'asciinema'
brew 'awscli'
brew 'bash'
brew 'bash-completion@2'
brew 'cfssl'
brew 'cowsay'
brew 'ddgr'
brew 'fping'
brew 'gh'
brew 'go'
brew 'grip'
brew 'helm'
brew 'htop'
brew 'hyperkit'
brew 'istioctl'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lolcat'
brew 'minikube'
brew 'mtr'
brew 'neofetch'
brew 'nmap'
brew 'podman'
brew 'pre-commit'
brew 'screen'
brew 'shellcheck'
brew 'shfmt'
brew 'skopeo'
brew 'sops'
brew 'telnet'
brew 'terragrunt'
brew 'tflint'
brew 'tmux'
brew 'vim'
brew 'watch'

# Casks
cask 'appcleaner'
cask 'brave-browser'
cask 'discord'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'handbrake'
cask 'macpass'
cask 'obsidian'
cask 'raspberry-pi-imager'
cask 'resilio-sync'
cask 'skype'
cask 'slack'
cask 'sniffnet'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'tunnelblick'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'qflipper'
cask 'zoom'
