# specify a directory to install
cask_args appdir: '~/Applications'

tap 'homebrew/bundle'

brew 'awscli'
brew 'helm'
brew 'htop'
brew 'jq'
brew 'minikube'
brew 'nmap'
brew 'siege'
brew 'watch'
brew 'youtube-dl'
brew 'telnet'
brew 'speedtest-cli'
brew 'warrensbox/tap/tfswitch'
brew 'terraform'
brew 'terragrunt'
brew 'consul'
brew 'vault'
brew 'bash'
brew 'oracle-jdk'
brew 'neofetch'
brew 'vim'
brew 'pass'
brew 'fping'

# Casks
cask 'google-cloud-sdk'
cask 'dropbox'
cask 'google-chrome'
cask 'firefox'
cask 'tor-browser'
cask 'skype'
cask 'slack'
cask 'telegram'
cask 'zoom'
cask 'whatsapp'
cask 'tunnelblick'
cask 'sublime-text'
cask 'docker'
cask 'macpass'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vagrant'
cask 'vlc'
cask 'typora'
cask 'transmission'
cask 'spotify'
cask 'multipass'
cask 'discord'
cask 'the-unarchiver'
